nc: 7
scales:
#   [depth, width, max_channels]
  s: [0.33, 0.50, 1024]  #

backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, SwinTransformer, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 3, GAM, [1024]]
  - [-1, 1, SPPF, [1024, 5]]  # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 11
  - [-1, 1, CBAM, [512]]  # Add CBAM after Upsample
  - [[-1, 6], 1, Concat, [1]]  # 13 cat backbone P4
  - [-1, 3, C2f, [512, False]]  # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [-1, 1, CBAM, [256]]  # Add CBAM after Upsample
  - [[-1, 4], 1, Concat, [1]]  # 17 cat backbone P3
  - [-1, 3, C2f, [256, False]]  # 18

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 19
  - [-1, 1, CBAM, [128]]  # Add CBAM after Upsample
  - [[-1, 2], 1, Concat, [1]]  # 21 cat backbone P2
  - [-1, 1, C2f, [128, False]]  # 22

  - [-1, 1, Conv, [128, 3, 2]]  # 23
  - [[-1, 18], 1, Concat, [1]]  # 24 cat head P3
  - [-1, 3, C2f, [256, False]]  # 25

  - [-1, 1, Conv, [256, 3, 2]]  # 26
  - [[-1, 14], 1, Concat, [1]]  # 27 cat head P4
  - [-1, 3, C2f, [512, False]]  # 28

  - [-1, 1, Conv, [512, 3, 2]]  # 29
  - [[-1, 10], 1, Concat, [1]]  # 30 cat head P5
  - [-1, 3, C2f, [1024, False]]  # 31

  - [[22, 25, 28, 31], 1, Detect, [nc]]  # 32 Detect(P2, P3, P4, P5)
